import json

# data1 = '{"data":{"admin":false,"chapterTops":[],"coinCount":13250,"collectIds":[17956,22665,24452,24889,24206,8857,' \
#         '22365,23646,23347,24990,8852,8985,8926,9002,8836,9067,8832,8821,8812,21630,21251,20946,20867,20514,18965,' \
#         '18930,18281,18615,18453,18072,17920,17629,17564,17083,16771,8808,8735,8723,9078,9088,9096,8710,13244,16929,' \
#         '16848,16717,16634,15949,15797,12574,8709,8697,8685,9113,9177,8656,8672,8665,8663,8680,15215,15188,11077,' \
#         '12489,12701,11159,10669,11476,11287,10574,11363,11387,10811,10892,10482,21826,8613,20087,-1,26578,26503,' \
#         '26582,26583],"email":"753 Main Street","icon":"","id":36899,"nickname":"ymw001","password":"",' \
#         '"publicName":"ymw001","token":"","type":0,"username":"ymw001"},"errorCode":0,"errorMsg":""} '
# # print(type(data1))
# # print(data1)
#
# # 将json 转化为字典，用loads()方法
# m = json.loads(data1)
# print(m)

# 将字典转化为json，用dumps（）方法
data3 = {"name": "小红", "age": 18, "对象": None}
n = json.dumps(data3,ensure_ascii=False)  # 把字典内的汉字转义，如需继续汉字显示，需添加参数，ensure_ascii=False ,默认是True
print(n)
